# 第六章 数据加载、存储与文件格式

## 6.1读写文本格式的数据

In [1]:
!cat examples/ex1.csv

'cat' 不是内部或外部命令，也不是可运行的程序
或批处理文件。

In [10]:
import pandas as pd

In [3]:
df=pd.read_csv('examples/ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('examples/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_csv('examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('examples/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d nessage
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [14]:
names=['a','b','c','d','message']

In [15]:
pd.read_csv('examples/ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [16]:
parsed=pd.read_csv('examples/csv_mindex.csv',index_col=['key1','key2'])

In [18]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [25]:
result=pd.read_table('examples/ex3.txt',sep='\s+')

In [26]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [32]:
pd.read_csv('examples/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [33]:
result=pd.read_csv('examples/ex5.csv')

In [34]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [35]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [41]:
result=pd.read_csv('examples/ex5.csv',na_values=['NULL'])

In [42]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [43]:
sentinels={'message':['foo','NA'],'something':['two']}

In [44]:
pd.read_csv('examples/ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [45]:
pd.options.display.max_rows=10

In [46]:
result=pd.read_csv('examples/ex6.csv')

In [47]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [48]:
pd.read_csv('examples/ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [49]:
chunker=pd.read_csv('examples/ex6.csv',chunksize=1000)

In [50]:
chunker

In [51]:
tot=pd.Series([])

In [52]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)

In [53]:
tot=tot.sort_values(ascending=False)

In [54]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [55]:
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

In [56]:
data=pd.read_csv('examples/ex5.csv')

In [57]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [58]:
data.to_csv('examples/out.csv')

In [59]:
import sys

In [60]:
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [61]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [62]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [63]:
data.to_csv(sys.stdout,index=False,columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [66]:
dates=pd.date_range('1/1/2000',periods=7)

In [69]:
ts=pd.Series(np.arange(7),index=dates)

In [68]:
import numpy as np

In [70]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [71]:
ts.to_csv('examples/tseries.csv')

In [72]:
import csv

In [102]:
f=open('examples/ex7.csv')

In [91]:
reader=csv.reader(f)

In [92]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [100]:
with open('examples/ex7.csv') as f:
    lines=list(csv.reader(f))

In [94]:
header,values=lines[0],lines[1:]

In [95]:
data_dict={h:v for h,v in zip(header,zip(*values))}

In [96]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [97]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter=';'
    quotechar='"'
    quoting=csv.QUOTE_MINIMAL

In [109]:
reader=csv.reader(f,dialect=my_dialect)

In [110]:
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [111]:
reader = csv.reader(f,delimiter='|')

In [113]:
for line in reader:
    print(line)

In [114]:
import json

In [123]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [124]:
result = json.loads(obj)

In [125]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [126]:
asjson=json.dumps(result)

In [127]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [128]:
siblings=pd.DataFrame(result['siblings'],columns=['name','age'])

In [129]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [130]:
data=pd.read_json('examples/example.json')

In [131]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [132]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [133]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [134]:
tables=pd.read_html('examples/fdic_failed_bank_list.html')

In [135]:
len(tables)

1

In [136]:
failures=tables[0]

In [137]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [139]:
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [140]:
close_timestamps=pd.to_datetime(failures['Closing Date'])

In [141]:
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [142]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [143]:
from lxml import objectify

In [144]:
path = 'examples/Performance_MNR.xml'

In [145]:
parsed=objectify.parse(open(path))

In [146]:
root=parsed.getroot

In [147]:
data=[]

In [148]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ','DESIRED_CHANGE', 'DECIMAL_PLACES']

In [ ]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [149]:
perf=pd.DataFrame(data)

In [150]:
perf.head()

Empty DataFrame
Columns: []
Index: []

In [151]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [152]:
root

In [153]:
root.get('href')

'http://www.google.com'

In [154]:
root.text

'Google'

## 6.2二进制数据格式

In [155]:
frame=pd.read_csv('examples/ex1.csv')

In [156]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [157]:
frame.to_pickle('examples/frame_pickle')

In [158]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [159]:
frame=pd.DataFrame({'a':np.random.randn(100)})

In [175]:
store=pd.HDFStore('mydata.h5')

In [161]:
store['obj1']=frame

In [162]:
store['obj1_col']=frame['a']

In [163]:
frame

           a
0   0.584325
1  -2.106447
2  -0.889870
3   0.553815
4   0.775383
..       ...
95  0.137161
96  1.118363
97 -0.681342
98 -0.640740
99  0.787942

[100 rows x 1 columns]

In [176]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [177]:
store['obj1']

           a
0   0.584325
1  -2.106447
2  -0.889870
3   0.553815
4   0.775383
..       ...
95  0.137161
96  1.118363
97 -0.681342
98 -0.640740
99  0.787942

[100 rows x 1 columns]

In [178]:
store.put('obj2',frame,format='table')

In [170]:
store.select('obj2',where=['index >= 10 and index <= 15'])

           a
10 -2.452226
11 -0.925422
12 -0.762476
13 -0.304068
14  0.991818
15  0.300186

In [179]:
store.close()

In [180]:
frame.to_hdf('mydata.h5','obj3',format='table')

In [181]:
pd.read_hdf('mydata.h5','obj3',where=['index < 5'])

          a
0  0.584325
1 -2.106447
2 -0.889870
3  0.553815
4  0.775383

In [182]:
xlsx=pd.ExcelFile('examples/ex1.xlsx')

In [183]:
pd.read_excel(xlsx,'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [184]:
frame=pd.read_excel(xlsx,'Sheet1')

In [185]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [186]:
writer=pd.ExcelWriter('examples/ex2.xlsx')

In [187]:
frame.to_excel(writer,'Sheet1')

In [188]:
writer.save()

In [189]:
frame.to_excel('examples/ex2.xlsx')

## 6.3Web APIs交互

In [191]:
import requests

In [192]:
url='https://api.github.com/repos/pandas-dev/pandas/issues'

In [193]:
resp=requests.get(url)

In [194]:
resp

In [196]:
data=resp.json()

In [197]:
data[0]['title']

'CLN: remove nested error handling'

In [200]:
data[1]

{'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/27791',
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/27791/labels{/name}',
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/27791/comments',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/27791/events',
 'html_url': 'https://github.com/pandas-dev/pandas/pull/27791',
 'id': 477636023,
 'node_id': 'MDExOlB1bGxSZXF1ZXN0MzA0OTI0MzEz',
 'number': 27791,
 'title': 'CLN: Assorted Cleanups',
 'user': {'login': 'jbrockmendel',
  'id': 8078968,
  'node_id': 'MDQ6VXNlcjgwNzg5Njg=',
  'avatar_url': 'https://avatars1.githubusercontent.com/u/8078968?v=4',
  'gravatar_id': '',
  'url': 'https://api.github.com/users/jbrockmendel',
  'html_url': 'https://github.com/jbrockmendel',
  'followers_url': 'https://api.github.com/users/jbrockmendel/followers',
  'following_url': 'https://api.github.com/users/jbrockmendel/following{/other_user}',
  'gists_url': 'https://api.github.com/users/jbrockmendel/gists{/gist_id}',
  'starred_url': 'https://api.github.com/users/jbrockmendel/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/jbrockmendel/subscriptions',
  'organizations_url': 'https://api.github.com/users/jbrockmendel/orgs',
  'repos_url': 'https://api.github.com/users/jbrockmendel/repos',
  'events_url': 'https://api.github.com/users/jbrockmendel/events{/privacy}',
  'received_events_url': 'https://api.github.com/users/jbrockmendel/received_events',
  'type': 'User',
  'site_admin': False},
 'labels': [],
 'state': 'open',
 'locked': False,
 'assignee': None,
 'assignees': [],
 'milestone': None,
 'comments': 1,
 'created_at': '2019-08-06T23:23:59Z',
 'updated_at': '2019-08-07T00:57:00Z',
 'closed_at': None,
 'author_association': 'MEMBER',
 'pull_request': {'url': 'https://api.github.com/repos/pandas-dev/pandas/pulls/27791',
  'html_url': 'https://github.com/pandas-dev/pandas/pull/27791',
  'diff_url': 'https://github.com/pandas-dev/pandas/pull/27791.diff',
  'patch_url': 'https://github.com/pandas-dev/pandas/pull/27791.patch'},
 'body': '- make PTA/DTA strftime() return ndarray instead of Index\r\n- fix a xfailed Series[Period] test\r\n- avoid imports of Index subclass in arrays.categorical and arrays.datetimelike\r\n- some typing'}

In [201]:
issues=pd.DataFrame(data,columns=['number','title','labels','state'])

In [202]:
issues

,number,title,labels,state
0,27792,CLN: remove nested error handling,[],open
1,27791,CLN: Assorted Cleanups,[],open
2,27790,BUG: Increase range of dates for holiday calcu...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,27789,DOC: add print statement in to_latex example,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
4,27788,TST: Add tests for groupby categorical values ...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
...,...,...,...,...
25,27762,BUG: right merge not preserve row order (#27453),[],open
26,27761,Error in business-day logic in CustomBusinessDay?,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,27760,merge_ordered() should accept left_index and r...,[],open
28,27758,Cannot plot empty Series,[],open
29,27756,Error reading parquet from s3 with s3fs >= 0.3.0,"[{'id': 2301354, 'node_id': 'MDU6TGFiZWwyMzAxM...",open

## 6.4 数据库交互

In [1]:
import sqlite3

In [2]:
query="""
    CREATE TABLE test
    (a VARCHAR(20),b VARCHAR(20),
    c REAL,d INTEGER);
"""

OperationalError: table test already exists

In [ ]:
con=sqlite3.connect('mydata.sqlite')

In [ ]:
con.execute(query)

In [ ]:
con.commit()

In [3]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [ ]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [232]:
con.executemany(stmt,data)

OperationalError: database is locked

In [5]:
cursor=con.execute('select * from test')

In [6]:
rows=cursor.fetchall()

In [7]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [8]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [11]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [12]:
import sqlalchemy as sqla

In [13]:
db=sqla.create_engine('sqlite:///mydata.sqlite')

In [14]:
pd.read_sql('select * from test',db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5